{
	"name": "Token Teleporter",
	"script": "TokenTeleporter.js",
	"version": "1.0.3",
	"previousversions": ["1.0.2"],
	"description": "Token Teleporter v1.0.3\rNeed a way of getting your players automatically from map to map as they go up and down stairs? Tired of dragging everyone over, and possibly dragging them where they shouldn't be? Tired of dealing with how much distance is between one edge of the map and another? Get Token Teleporter! Token Teleporter utilizes tokens on the GM Layer to specify where your Tokens, GM and Player should go to, and where they should move from.\r\rNOTE: Token Teleporter makes use out of the GM Notes section on tokens that are Teleport Pads. If you intend to utilize the GM Notes on Teleport Pads, make sure you add them as properties inside of the GM Notes JSON. Otherwise, if you are unsure on how to do this, simply make separate tokens for notes along this line.\r\rUsing Token Teleporter:\rTo begin using Token Teleporter, you need to drop down some Tokens on the GM Layer that represent your Teleport Pads. While a destination teleport pad does not need to be configured (for one way travel), the source must be configured when it is dropped onto the map.\rThe simplest option for an automatic teleport pad is to select it, and then use !Teleport --destination <OtherTeleportPadName> . This will configure the automatic teleport pad correctly for automatic teleporting for your GM and Player tokens.\r\rNeed more options? Check out !Teleport --help for more information, including Blocking Player teleporting, allowing named teleporting (which allows you to push players to a specific place). Got a wide space, or random places to teleport to? Create multiple pads with the same name, and watch as players teleport randomly to those pads!",
	"authors": "Zachare Sylvestre (Imper1um)",
	"useroptions": [],
	"roll20userid": "3482602",
	"dependencies": [],
	"modifies": {
		"graphic.left": "read, write",
		"graphic.top": "read, write",
		"graphic.gmnotes": "read, write",
		"graphic.name": "read, write"
	},
	"conflicts": []	
}